app/Models/LoginModel.php

    public function checkLogin($username,$password,$if_loggable = true, $if_match_password = true)
    { // echo 'username='.$username.' password='.$password;// exit();
        $builder = $this->db->table("master.users");
        $builder->select("*");
        $builder->WHERE('empid',$username);
        $builder->WHERE('display','Y');
        $query =$builder->get(1);
---
SELECT *
FROM "master"."users"
WHERE "empid" = '1'
AND "display" = 'Y'
 LIMIT 1

    function login_in_update($username){
        $builder = $this->db->table("master.users");
        $builder->set('log_in', date('Y-m-d H:i:s'));
        $builder->set('logout', '1970-01-01 00:00:00');
        $builder->WHERE('empid',$username);
        $builder->WHERE('display','Y');
        // $builder->update();
        if($builder->update()) {
---
UPDATE "master"."users" SET "log_in" = '2024-07-22 02:23:23', "logout" = '1970-01-01 00:00:00'
WHERE "empid" = '1'
AND "display" = 'Y'

    public function log_check($log_check_data)
    {
        $builder = $this->db->table("log_check");
        if($builder->insert($log_check_data)) {
---
INSERT INTO "log_check" ("usercode", "username", "logging", "addr", "mac_addr") VALUES ('1', 'Super User', '2024-07-22 02:23:23', '::1', '')